addresses/templates/addresses/get_street_by_zipcode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://cliente.bean.master.sigep.bsb.correios.com.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <cli:consultaCEP>
         <cep>{{ zipcode }}</cep>
      </cli:consultaCEP>
   </soapenv:Body>
</soapenv:Envelope>